In [1]:
import pandas as pd

In [2]:
df = pd.read_excel(r"C:\Users\THIS\Downloads\Ecomm.xlsx")

In [3]:
df.shape

(24, 12)

In [5]:
df.head(2)

,CustomerID,CustomerID.1,Order Date,Month,MonthName,DateInText,Customer Name,State or Province,City,Gender,Gender.1,Gender.2
0,CUS7253,7253,2015-01-07,1,Jan,01/07/2015,Bonnie Potter,Washington,Anacortes,M,1,MALE
1,CUS4875,4875,2015-06-13,6,Jun,06/13/2015,Ronnie Proctor,California,San Gabriel,F,0,FEMALE

In [6]:
# This excel file has 2 sheets 1. Jan , 2. CustomerDetails

In [11]:
customer = pd.read_excel(r"C:\Users\THIS\Downloads\Ecomm.xlsx" , sheet_name='CustomerDetail')

In [12]:
customer.head(2)

,CustomerID,CustomerID.1,Order Date,Month,MonthName,DateInText,Customer Name,State or Province,City,Gender,Gender.1,Gender.2
0,CUS7253,7253,2015-01-07,1,Jan,01/07/2015,Bonnie Potter,Washington,Anacortes,M,1,MALE
1,CUS4875,4875,2015-06-13,6,Jun,06/13/2015,Ronnie Proctor,California,San Gabriel,F,0,FEMALE

In [13]:
orders = pd.read_excel(r"C:\Users\THIS\Downloads\Ecomm.xlsx" , sheet_name='Jan')

In [14]:
orders.head(3)

,Order ID,CustomerID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,88522,4666,11.36,4.5600,4,Office Supplies,Pens & Art Supplies,Credit Card
1,90193,4663,6011.76,4390.3665,12,Furniture,Chairs & Chairmats,Credit Card
2,90192,2583,208.56,-53.8096,22,Furniture,Office Furnishings,Credit Card

In [16]:
# Checking for cleaning process
customer.isnull().sum()

CustomerID           0
CustomerID.1         0
Order Date           0
Month                0
MonthName            0
DateInText           0
Customer Name        0
State or Province    0
City                 0
Gender               0
Gender.1             0
Gender.2             0
dtype: int64

In [17]:
customer.head(2)

,CustomerID,CustomerID.1,Order Date,Month,MonthName,DateInText,Customer Name,State or Province,City,Gender,Gender.1,Gender.2
0,CUS7253,7253,2015-01-07,1,Jan,01/07/2015,Bonnie Potter,Washington,Anacortes,M,1,MALE
1,CUS4875,4875,2015-06-13,6,Jun,06/13/2015,Ronnie Proctor,California,San Gabriel,F,0,FEMALE

In [18]:
customer.columns

Index(['CustomerID', 'CustomerID.1', 'Order Date', 'Month', 'MonthName',
       'DateInText', 'Customer Name', 'State or Province', 'City', 'Gender',
       'Gender.1', 'Gender.2'],
      dtype='object')

In [19]:
customer = customer.drop(columns=['CustomerID','Month', 'MonthName','DateInText','Gender.1', 'Gender.2'])

In [20]:
customer.head(3)

,CustomerID.1,Order Date,Customer Name,State or Province,City,Gender
0,7253,2015-01-07,Bonnie Potter,Washington,Anacortes,M
1,4875,2015-06-13,Ronnie Proctor,California,San Gabriel,F
2,2748,2015-02-15,Marcus Dunlap,New Jersey,Roselle,M

In [21]:
customer.shape

(24, 6)

In [22]:
# Cleaning orders dataset

In [23]:
orders.head(2)

,Order ID,CustomerID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,88522,4666,11.36,4.5600,4,Office Supplies,Pens & Art Supplies,Credit Card
1,90193,4663,6011.76,4390.3665,12,Furniture,Chairs & Chairmats,Credit Card

In [24]:
orders.isnull().sum()

Order ID                0
CustomerID              0
Amount                  0
Profit                  0
Quantity ordered new    0
Product Category        0
Product Sub-Category    0
Payment Mode            0
dtype: int64

In [25]:
orders = orders.drop(columns=['Order ID'])

In [26]:
orders.head(2)

,CustomerID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,4666,11.36,4.5600,4,Office Supplies,Pens & Art Supplies,Credit Card
1,4663,6011.76,4390.3665,12,Furniture,Chairs & Chairmats,Credit Card

In [27]:
orders.shape

(1952, 7)

In [28]:
# Group BY functions

In [30]:
orders['Product Category'].unique()

array(['Office Supplies', 'Furniture', 'Technology'], dtype=object)

In [34]:
print("Total Profit : ",round(orders['Profit'].sum(),2),"INR")

Total Profit :  224114.64 INR

In [36]:
orders.groupby(['Product Category']).agg({'Profit':'sum'})

                        Profit
Product Category
Furniture         59249.445936
Office Supplies   89562.039537
Technology        75303.156364

In [37]:
orders.groupby(['Product Category']).agg({'Profit':'sum'}).reset_index()

  Product Category        Profit
0        Furniture  59249.445936
1  Office Supplies  89562.039537
2       Technology  75303.156364

In [38]:
pbc = orders.groupby(['Product Category']).agg({'Profit':'sum'}).reset_index()

In [40]:
orders.groupby(['Product Sub-Category']).agg({'Profit':'sum'}).reset_index()

              Product Sub-Category        Profit
0                       Appliances  12594.820600
1   Binders and Binder Accessories  59296.389430
2                        Bookcases   -930.438400
3               Chairs & Chairmats  48695.836600
4             Computer Peripherals   1698.043980
5                  Copiers and Fax  23990.207580
6                        Envelopes  -1194.412500
7                           Labels   7028.159500
8               Office Furnishings  18724.119100
9                  Office Machines   8824.390564
10                           Paper   7769.315070
11             Pens & Art Supplies   -220.598800
12                    Rubber Bands  -1544.826063
13   Scissors, Rulers and Trimmers  -1291.095900
14          Storage & Organization   7124.288200
15                          Tables  -7240.071364
16    Telephones and Communication  40790.514240

In [39]:
pbc

  Product Category        Profit
0        Furniture  59249.445936
1  Office Supplies  89562.039537
2       Technology  75303.156364

In [41]:
orders.groupby(['Product Category','Product Sub-Category']).agg({'Profit':'sum'}).reset_index()

   Product Category            Product Sub-Category        Profit
0         Furniture                       Bookcases   -930.438400
1         Furniture              Chairs & Chairmats  48695.836600
2         Furniture              Office Furnishings  18724.119100
3         Furniture                          Tables  -7240.071364
4   Office Supplies                      Appliances  12594.820600
5   Office Supplies  Binders and Binder Accessories  59296.389430
6   Office Supplies                       Envelopes  -1194.412500
7   Office Supplies                          Labels   7028.159500
8   Office Supplies                           Paper   7769.315070
9   Office Supplies             Pens & Art Supplies   -220.598800
10  Office Supplies                    Rubber Bands  -1544.826063
11  Office Supplies   Scissors, Rulers and Trimmers  -1291.095900
12  Office Supplies          Storage & Organization   7124.288200
13       Technology            Computer Peripherals   1698.043980
14       Technology                 Copiers and Fax  23990.207580
15       Technology                 Office Machines   8824.390564
16       Technology    Telephones and Communication  40790.514240

In [42]:
customer.head(2)

,CustomerID.1,Order Date,Customer Name,State or Province,City,Gender
0,7253,2015-01-07,Bonnie Potter,Washington,Anacortes,M
1,4875,2015-06-13,Ronnie Proctor,California,San Gabriel,F

In [43]:
orders.head(2)

,CustomerID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,4666,11.36,4.5600,4,Office Supplies,Pens & Art Supplies,Credit Card
1,4663,6011.76,4390.3665,12,Furniture,Chairs & Chairmats,Credit Card

In [48]:
len(customer['CustomerID.1']) , len(customer['CustomerID.1'].unique())

(24, 24)

In [49]:
# We have all unique customers in customer dataset

In [50]:
# Renaming a column name 
customer = customer.rename(columns={'CustomerID.1':'CustomerID'})

In [51]:
customer.head(2)

   CustomerID Order Date   Customer Name State or Province         City Gender
0        7253 2015-01-07   Bonnie Potter        Washington    Anacortes      M
1        4875 2015-06-13  Ronnie Proctor        California  San Gabriel      F

In [52]:
# we are merging customer and orders data together
df = pd.merge(customer,orders,on='CustomerID')

In [53]:
df.shape

(1952, 12)

In [54]:
df.head(3)

,CustomerID,Order Date,Customer Name,State or Province,City,Gender,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,4666,2015-05-12,Gwendolyn F Tyson,Minnesota,Prior Lake,M,11.36,4.560000,4,Office Supplies,Pens & Art Supplies,Credit Card
1,4666,2015-05-12,Gwendolyn F Tyson,Minnesota,Prior Lake,M,94.27,105.678000,11,Office Supplies,"Scissors, Rulers and Trimmers",Credit Card
2,4666,2015-05-12,Gwendolyn F Tyson,Minnesota,Prior Lake,M,285.84,-2177.986096,9,Furniture,Tables,Credit Card

In [55]:
df.groupby(['State or Province']).agg({'Profit':'sum'}).reset_index()

  State or Province        Profit
0        California  31886.448316
1         Minnesota  34330.365504
2           Montana  15291.345669
3          New York  98143.568974
4            Oregon  44462.913374